rasi_up = [
    {"zh": "甲", "th": "ไม้หยาง", "symbol": "ม+"},
    {"zh": "乙", "th": "ไม้หยิน", "symbol": "ม-"},
    {"zh": "丙", "th": "ไฟหยาง", "symbol": "ฟ+"},
    {"zh": "丁", "th": "ไฟหยิน", "symbol": "ฟ-"},
    {"zh": "戊", "th": "ดินหยาง", "symbol": "ด+"},
    {"zh": "己", "th": "ดินหยิน", "symbol": "ด-"},
    {"zh": "庚", "th": "ทองหยาง", "symbol": "ท+"},
    {"zh": "辛", "th": "ทองหยิน", "symbol": "ท-"},
    {"zh": "壬", "th": "น้ำหยาง", "symbol": "น+"},
    {"zh": "癸", "th": "น้ำหยิน", "symbol": "น-"},
]

rasi_down = [
    {"zh": "子", "th": "ชวด"},
    {"zh": "丑", "th": "ฉลู"},
    {"zh": "寅", "th": "ขาล"},
    {"zh": "卯", "th": "เถาะ"},
    {"zh": "辰", "th": "มะโรง"},
    {"zh": "巳", "th": "มะเส็ง"},
    {"zh": "午", "th": "มะเมีย"},
    {"zh": "未", "th": "มะแม"},
    {"zh": "申", "th": "วอก"},
    {"zh": "酉", "th": "ระกา"},
    {"zh": "戌", "th": "จอ"},
    {"zh": "亥", "th": "กุน"},
]

element_meaning = {

    "甲": {
        "title": "ไม้หยาง",
        "good": "พัฒนา ใฝ่รู้ จิตใจเมตตา พึ่งพาอาศัยยามทุกข์ร้อนได้ มีความสุขกับการแนะนำคนอื่น เข้มแข็ง\
            เปลี่ยนแปลงได้เร็ว แน่วแน่ รักศักดิ์ศรี มานะบากบั่น ตรงไปตรงมา ตัดสินใจเร็ว",
        "bad": "หัวแข็ง ไม่โอนอ่อนผ่อนตาม ไม่ยืดหยุ่น คิดว่าวิธีการของตัวเองดีที่สุด ดื้อ เชื่อมั่นในตัวเองสูง\
            คิดเร็ว ขาดความลึก ไม่ถ้วนถี่ หยิ่งศักดิ์ศรี ชอบวิจารณ์ ชอบวิวาทะ เสียงดังโผงผาง หากจำเป็นก็\
            สามารถเปลี่ยนตัวเองกลายเป็นหอกเพื่อต่อสู้ป้องกันเอาชนะ โกรธแบบนิ่งๆ",
        "advice": "พัฒนาจนเป็นผู้เชี่ยวชาญเฉพาะทาง และออกสังคมคบหาสมาคมกับคนทุกระดับ",
    },


    "乙": {
        "title": "ไม้หยิน",
        "good": "เก่งศิลปะ วิทยาการ ช่างประดิษฐ์ คิดค้น อ่อนนอกแข็งใน ไม่ยอมถอย อ่อนโยน สง่างาม \
            เชาวน์ปัญญา ฉลาดในการใช้ถ้อยคำ นิ่มนวล เป็นนักพูดโดยกำเนิด เป็นนักคิดรอบรู้หลบรู้สู้ \
            ไม่ชอบทะเลาะขัดแย้ง สนุกสนาน รู้จักคบคนและใช้ประโยชน์จากเส้นสายได้ดี ปรับตัวเก่ง \
            สร้างเครือข่ายความสัมพันธ์เก่ง",
        "bad": "ขี้น้อยใจ คิดเล็กคิดน้อย แอบอิจฉา มีเลศนัย ต่อสู้เอาชนะ แบบรุกคืบ (เหมือนไม้เลื้อย เถาวัลย์) \
            มีแผนการณ์แอบแฝง ฉลาดแกมโกง โลภ พยาบาท เจ้าอารมณ์ แม้มีแรงบันดาลใจ แต่ขาดวินัย \
            ไม่แน่นอน ไม่ผูกมัด ไม่ต่อเนื่อง ทำจริงจังเป็นช่วงๆ เหมือนฤดูกาล ใช้ชีวิตแบบขึ้นอยู่กับคนอื่นๆ",
        "advice": "ควรพาตัวเองไปอยู่ในสังคมที่ใช่ แล้วเรียนรู้จากทุกคน นำไปใช้พัฒนาความรู้ของตนเองอย่างต่อเนื่อง",
    },


    "丙": {
        "title": "ไฟหยาง",
        "good": "เปิดเผย ชัดเจน ตรงประเด็น มุ่งมั่น กระตือรือร้น ชอบโดดเด่น รักชื่อเสียง หยิ่งในเกียรติศักดิ์ศรี \
            รักษาหน้าตาภาพพจน์ น่าเกรงขาม ไม่ยอมแพ้ ไม่ลดละ คิดบวก ไม่ติดอยู่ในอดีต ปรับตัวเข้าหาคนอื่นเก่ง \
            เข้ากับคนอื่นได้ง่าย มีแรงจูงใจ เก่งเรื่องจัดการทรัพยากร เห็นอกเห็นใจคนอื่น จงรักภักดี \
            ทำกิจวัตรประจำวันซ้ำๆ ได้",
        "bad": "ใจร้อน โกรธง่ายหายเร็ว พูดไว มีทิฐิสูง ความคิดตนเป็นใหญ่ \
            มักจะคิดว่าโลกหมุนรอบตัวเองเหมือนกับดวงอาทิตย์ บ้ายอ ไม่ยอมเสียหน้า ติดกับความเคยชิน \
            ไม่ค่อยแสวงหาความเปลี่ยนแปลง ทำตามกฎเกณฑ์ เป็นคนหัวเก่าในโลกธุรกิจ ชอบทำสิ่งซ้ำๆ \
            ไม่นิยมความเสี่ยงสูง มองสิ่งต่างๆ บนพื้นฐานของอารมณ์ ความรู้สึก เพื่อนต้องมาก่อน \
            ผิดพลาดเรื่องเดิมๆ สร้างปัญหา แต่คอยตัวเหนือปัญหา คิดว่าตัวเองทำสิ่งที่ถูกต้อง",
        "advice": "เรียนรู้วิธีการและปฏิบัติวิธีใหม่ๆ ลดยึดติดวิธีการเดิมๆ เน้นรักษาคำสัญญา ชื่อเสียง",
    },


    "丁": {
        "title": "ไฟหยิน",
        "good": "เป็นคนอบอุ่น มีน้ำใจ เสียสละเพื่อคนอื่น มีมารยาท รอบคอบ ดูแลผู้อื่นมากกว่าตัวเอง \
            เกิดมาเป็นผู้นำ ภูมิใจที่จะชี้ให้ผู้อื่นได้เห็นถึงหนทางของตนเอง สามารถที่จะสร้างโอกาสให้แก่ตนเองได้ \
            เช่นเดียวกับเปลวไฟเล็กๆ ที่จุดประกายให้เกิดเป็นกองไฟกองใหญ่ พิถีพิถัน ระมัดระวังเป็นพิเศษ \
            เห็นรายละเอียดชัดเจน มีแรงบันดาลใจสูง โหมอย่างร้อนแรง แต่มอดเร็ว ขี้ระแวง \
            ช่วยกระตุ้นผลักดันผู้อื่นได้เป็นอย่างดี แต่อาจลืมที่จะจุดแสงไฟให้กับตนเอง!",
        "bad": "เปลี่ยนแปลงง่าย เอาแน่เอานอนไม่ได้ (เหมือนเปลวเทียนที่สั่นไหวโอนเอนไปมา) \
            บางครั้งหุนหันพลันแล่น อารมณ์อ่อนไหว มีบาดแผลในใจ เสียสละให้คนอื่นมากเกินไป",
        "advice": "ค้นคว้าหาความรู้ให้มาก ระดมสมองร่วมกับคนอื่น \
            เปิดรับมุมมองที่ใหม่และแตกต่างก่อนตัดสินใจในเรื่องใดเรื่องหนึ่ง แม้จะค้านกับมุมมองของเรา \
            ทำใจให้กว้าง เปิดรับคำวิพากษ์วิจารณ์ พยายามถ่อมตัว พร้อมที่จะขอโทษในความผิดพลาดใดๆ",
    },


    "戊": {
        "title": "ดินหยาง",
        "good": "หนักแน่น มีสัจจะ ยึดมั่นไม่เปลี่ยนแปลง คือรั้น ภายนอกอ่อนโยน ภายในแข็งแกร่ง \
            ชอบชื่อเสียง ช่วยเหลือผู้อื่นจนตัวเองเดือดร้อน ระมัดระวัง มั่นคง พึ่งพาได้ อดทน จริงใจ \
            ใจกว้าง น่าเชื่อถือ ให้ความสำคัญกับภาพลักษณ์ภายนอกหรือรูปร่างหน้าตา พอใจในสิ่งที่มี",
        "bad": "หัวแข็ง ดื้อดึง ผัดวันประกันพรุ่ง นิ่ง ช้า ความรู้สึกไม่ไว อยู่กับที่ ยึดติด ไม่เปลี่ยนแปลง \
            ตนเอง คิดนิ่ง ไม่ยอมฟังใคร ประมาท ลำพอง คือต้าน ไม่พิจารณาหรือคิดถึงรายละเอียดให้ลึก\
            เป็นเหตุให้เกิดอันตรายได้ง่าย หรือ จนกว่าจะผ่านบทเรียนราคาแพง",
        "advice": "เรียนรู้ที่จะคิดบนพื้นฐานของความเป็นจริง ฝึกฝนความคิดให้รู้จักแยกแยะมากขึ้น \
            และถืออารมณ์เป็นใหญ่น้อยลง พัฒนาทักษะฝีมือความสามารถ ความมุ่งมั่น เครดิตความเชื่อถือ",
    },


    "己": {
        "title": "ดินหยิน",
        "good": "มีความยืดหยุ่น สติปัญญาดี จำแม่น ช่างคิด มีสัญชาตญาณพิเศษ เก่งจัดทรัพยากร \
            ไปทีละขั้นตามกฎและจังหวะ ระมัดระวังในรายละเอียด มีใจเมตตา อ่อนโยน อารมณ์ดี อดทน \
            มีน้ำใจ มีคุณธรรม เข้าใจในความอ่อนแอและความผิดพลาดของผู้อื่น เข้าใจศาสนา \
            ถ้ารักใครก็จะเสียสละแบบไม่หวังผลตอบแทน พร้อมรองรับทุกคนในครอบครัว มีนิสัยเสมอ \
            ชอบตอบว่าอะไรก็ได้ เป็นคนชอบอยู่เบื้องหลังคอยสนับสนุน",
        "bad": "ตัดสินใจไม่รวดเร็ว เลือกไม่ค่อยถูก ขี้สงสัย คือ คิดเล็กคิดน้อย เสียสละได้เพียงระดับหนึ่ง \
            ฉวยโอกาส (ซับน้ำ) ชอบควบคุม รู้สึกมั่นคงมากขึ้นจากการมีหุ้นส่วน จะยึดมั่นวิธีการที่คุ้นเคย \
            แต่ขี้เบื่อของเก่า (คนที่เปลี่ยนสภาพง่าย) เช่น ชอบร้านอาหารใหม่ ไม่ไปซ้ำ",
        "advice": "เน้นทำงานหรือธุรกิจสายบริการ หรือธุรกิจที่เกี่ยวข้องกับการให้บริการสาธารณะ \
            จะดีต่อจิตใจคุณ อย่าเข้าทำสิ่งที่ขัดกับหลักการที่คุณยึดถือ",
    },


    "庚": {
        "title": "ทองหยาง",
        "good": "แข็งแกร่ง มานะบากบั่น อดทนต่อความทุกข์ยาก เปิดเผย มุ่งมั่น รักความท้าทาย \
            มีดวงวิญญาณแห่งการต่อสู้ ต่อสู้เพื่อความถูกต้อง ชอบเอาชนะ อยู่แนวหน้า กล้าตัดสินใจ \
            อดทนต่อความทุกข์ทรมานเพื่อที่จะบรรลุสู่เป้าหมายที่ตั้งเอาไว้ได้ รู้สึกดีในยามมาภาพลักษณ์ดี \
            ถ้าโครงสร้างดวงเหมาะสม จะมีนิสัยซื่อตรง ยุติธรรม ไม่หวั่นกลัวผู้มีอำนาจ",
        "bad": "อยากได้อะไรต้องได้ หุนหันพลันแล่น อยากเก่งที่สุด ไม่ยอมรับผิดพลาดง่ายๆ \
            อารมณ์อาจบดบังเหตุผล เพราะต้องการชัยชนะ ชอบเปรียบเทียบตัวเองกับคนอื่น กลัวความล้มเหลว \
            กังวลรูปโฉมภายนอก ต้องดูดีกว่าคนอื่นเสมอ ยืนกรานและดื้อ ชอบออกคำสั่ง ไม่ยอมเสียเปรียบ \
            พูดจาขวานผ่าซาก ขาดความยืดหยุ่น ใจเร็ว ด่วนตัดสินใจ โกรธง่าย",
        "advice": "พัฒนาทักษะการตลาด การเงิน การบริหารจัดการ มุ่งมั่นไปเป้าหมายอย่างไม่ท้อถอย \
            ปล่อยวางนิสัยความ “เจ้าคิดเจ้าแค้น” แล้วความสำเร็จจะตามมา",
    },


    "辛": {
        "title": "ทองหยิน",
        "good": "กิริยามารยาทดี อ่อนโยน รักสวยรักงาม มีศิลปะ อารมณ์สุนทรี มีเสน่ห์ สติปัญญาดี \
            มีไหวพริบพูดจา ตัดสินใจเด็ดขาด อดทน มั่นคง จิตใจนุ่มนวล ไม่กระด้าง ใฝ่สูง ทำงานประณีต \
            ไม่ชอบความรุนแรง แข็งนอกอ่อนใน รักแสงไฟ ชอบมีหน้ามีตา มีเกียรติ ชอบที่จะเป็นจุดสนใจของผู้อื่น \
            ชอบให้คนชื่นชม (เป็นนักพูดอันดับ 2 รองจากไม้หิน คำพูดคม บาดใจคนฟัง)",
        "bad": "มักตกเป็นเหยื่อของความโลภ ได้รับแรงบันดาลใจ จากสิ่งตอบแทนทางวัตถุ ปรารถนาสิ่งประณีตงดงาม \
            ภาพลักษณ์สำคัญมาก ใจเร็ววู่วามได้และตื่นตูม ต้องการคำชมเชย อวดความรู้หรือทักษะพิเศษ \
            พูดมากทำน้อย ขาดความกล้า เอาแน่นอนไม่ได้ ชอบบงการ เห็นห่าง ชอบใช้อำนาจ \
            สามารถถูกชักนำให้คล้อยตามได้ง่าย (ค่อนข้างหูเบา) ถ้าเมื่อใดที่ไม่ได้รับความสนใจ \
            จะสามารถสร้างสถานการณ์ที่ทำให้ตนเองโดดเด่นขึ้นมาได้ทันที ! การชอบแย่งเป็นจุดสนใจบางครั้ง\
            ทำให้พวกเขาน่ารำคาญและตกต่ำลง",
        "advice": "พัฒนาทักษะการตลาด การเงิน การบริหารจัดการ ใช้เหตุผลในขณะตัดสินใจ มากกว่าอารมณ์",
    },


    "壬": {
        "title": "น้ำหยาง",
        "good": "มุ่งมั่นทะเยอทะยาน ตื่นตัว ปรับตัวเก่ง ฉลาดมาก สร้างสรรค์ ช่างประดิษฐ์คิดค้น มองภาพใหญ่ \
            องอาจ กล้าหาญ เข้ากับคนง่าย เข้าได้กับคนหลายๆ กลุ่มพร้อมกัน แม่นยำ เก่งวิเคราะห์ มีระเบียบแบบแผน \
            เป็นระบบ คิดเร็วเป็นเหตุเป็นผล จำเก่ง ซึมซับข้อมูลข่าวสารได้ดี อยากรู้อยากเห็น ไหวพริบดี ฉลาด \
            ชอบใช้ความคิด ความรู้กว้างขวาง มีความสามารถ โกรธง่ายหายเร็ว เปลี่ยนสีหน้าเร็ว ชอบการเปลี่ยนแปลง \
            อารมณ์แปรปรวน กระตือรือร้น ไม่สามารถยืน/นั่งอยู่กับที่นานๆ ได้ (น้ำเคลื่อนไหวอยู่เสมอ) \
            จิตใจออกแนวกว้างวุ่นได้ง่าย ขาดความตั้งมั่น รักอิสระ ชอบท่องเที่ยว เดินทาง ชอบเสี่ยง ผจญภัย \
            กิจกรรมลุยๆ ตั้งใจทำสิ่งใดแล้วจะไม่หยุด ดื้อรั้น บังคับยาก ไม่ชอบทำตามผู้อื่น",
        "bad": "ตกอยู่ในอิทธิพลของกระแสสังคม กังวลกับแนวโน้มปัจจุบันมากเกินไป มีเพื่อนเยอะ \
            แต่มีเพื่อนสนิทไม่กี่คน ไม่ชอบลงแรงทำงานเอง ต้องการให้คนอื่นทำแทน",
        "advice": "แสวงหาพันธมิตร พัฒนาความสัมพันธ์ให้ลึกซึ้ง ความเครียดและลดความโกรธให้น้อยลง",
    },


    "癸": {
        "title": "น้ำหยิน",
        "good": "ให้กำลังใจ อุทิศตัวให้แก่คนอื่น กระตือรือร้น มีอุดมคติ เกิดมาเป็นนักปรัชญา หยั่งรู้ \
            มีญาณสังหรณ์ ซับซ้อน คารมคมคาย พูดจาฉะฉาน รักความท้าทาย สนุกกับการเสี่ยง ซึ่งความน่าเบื่อ \
            รู้สึกดีที่อยู่ร่วมเป็นกลุ่ม มีน้ำใจ เฉลียวฉลาด จินตนาการสูง ความรู้สึกไว ชอบศึกษาสิ่งที่ลึกลับ \
            ค้นคว้าเรื่องยากๆ ไม่ชอบหยุดนิ่งอยู่กับที่ เรียนรู้เร็ว มีหลักการ เยือกเย็น อดทน ประหยัด เป็นครูที่ดี \
            เสมือนน้ำที่ใช้เพาะปลูกเพื่อการเจริญเติบโต พัฒนาสิ่งใหม่ๆ ค่อนไหวง่าย มีนิสัยเอาใจใส่ผู้อื่น \
            ระมัดระวังคำพูดและการกระทำของตัวเอง",
        "bad": "เปลี่ยนแปลงอารมณ์ง่าย เอาแน่นอนไม่ค่อยได้ ลึกลับ เปลี่ยนแปลงง่าย เจ้าอารมณ์ \
            ไม่มีรูปแบบตายตัว อาจหมกมุ่นครุ่นคิดมากเกินไป กังวลง่าย ใจไม่ค่อยกล้า ขี้ขลาด ไม่มีพิธีรีตอง \
            ชอบมีอิทธิพลกับคนอื่น ไม่ต้องการคำแนะนำ เข้าข้างพวกตน ขาดคุณธรรม ขี้เหนียว เงินต้องมาก่อน \
            อ่อนไหว ใจน้อย หมกมุ่นอยู่กับความคิดตนเอง ชอบเก็บตัว เก็บกดอารมณ์ คิดเล็กคิดน้อย \
            มีแนวโน้มอำมหิต",
        "advice": "ประสานจินตนาการและความมีเหตุผลเข้าด้วยกัน \
            และเรียนรู้วิธีพัฒนาการคิดอย่างมีวินัยโดยจัดโครงสร้างความคิดของพวกเขา",
    },

}

table_rasi_month = [
    {
        "start": (12, 8),
        "end": (1, 5),
        "zh": "子",
        "th": "ชวด",
    },
    {
        "start": (1, 6),
        "end": (2, 3),
        "zh": "丑",
        "th": "ฉลู",
    },
    {
        "start": (2, 4),
        "end": (3, 4),
        "zh": "寅",
        "th": "ขาล",
    },
    {
        "start": (3, 5),
        "end": (4, 4),
        "zh": "卯",
        "th": "เถาะ",
    },
    {
        "start": (4, 5),
        "end": (5, 5),
        "zh": "辰",
        "th": "มะโรง",
    },
    {
        "start": (5, 6),
        "end": (6, 5),
        "zh": "巳",
        "th": "มะเส็ง",
    },
    {
        "start": (6, 6),
        "end": (7, 6),
        "zh": "午",
        "th": "มะเมีย",
    },
    {
        "start": (7, 7),
        "end": (8, 7),
        "zh": "未",
        "th": "มะแม",
    },
    {
        "start": (8, 8),
        "end": (9, 8),
        "zh": "申",
        "th": "วอก",
    },
    {
        "start": (9, 9),
        "end": (10, 8),
        "zh": "酉",
        "th": "ระกา",
    },
    {
        "start": (10, 9),
        "end": (11, 7),
        "zh": "戌",
        "th": "จอ",
    },
    {
        "start": (11, 8),
        "end": (12, 7),
        "zh": "亥",
        "th": "กุน",
    },
]
